; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v4 - type_1 ?v1 - type_2)
 	      (pred_4 ?v3 - object ?v1 - type_2)
	      (pred_1 ?v4 - type_1 ?v8 - type_3)
	      (pred_2 ?v4 - type_1 ?v3 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v7 ?v2 - type_2)
       :precondition (and  (pred_3 ?v4 ?v7))
       :effect (and  (pred_3 ?v4 ?v2)
		     (not (pred_3 ?v4 ?v7))))

   (:action op_1
       :parameters (?v4 - type_1 ?v5 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v6) (pred_3 ?v4 ?v6) (pred_1 ?v4 ?v8))
       :effect (and (pred_2 ?v4 ?v5 ?v8)
		    (not (pred_4 ?v5 ?v6)) 
		    (not (pred_1 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_1 ?v5 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v5 ?v8) (pred_3 ?v4 ?v6))
       :effect (and (pred_4 ?v5 ?v6)
		    (pred_1 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v5 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_12 - type_1
obj_10 obj_01 obj_09 obj_11 - type_3
obj_04 obj_08 obj_02 obj_03 - type_2
obj_06 obj_05 obj_07 - object)
(:init
(pred_3 obj_13 obj_08)
(pred_1 obj_13 obj_10)
(pred_1 obj_13 obj_01)
(pred_3 obj_12 obj_03)
(pred_1 obj_12 obj_09)
(pred_1 obj_12 obj_11)
(pred_4 obj_06 obj_02)
(pred_4 obj_05 obj_02)
(pred_4 obj_07 obj_08)
)
(:goal
(and
(pred_4 obj_06 obj_08)
(pred_4 obj_05 obj_04)
(pred_4 obj_07 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_13 obj_08) (pred_3 obj_12 obj_08))))
    (always (not (and (pred_3 obj_13 obj_02) (pred_3 obj_12 obj_02))))
  )
)
)

; plan
1. (op_1 obj_13 obj_07 obj_08 obj_01)
   deleted: (pred_4 obj_07 obj_08) (pred_1 obj_13 obj_01)
   added: (pred_2 obj_13 obj_07 obj_01)
   goals met: 0 of 3
2. (op_3 obj_12 obj_03 obj_04)
   deleted: (pred_3 obj_12 obj_03)
   added: (pred_3 obj_12 obj_04)
   goals met: 0 of 3
3. (op_3 obj_13 obj_08 obj_04)
   deleted: (pred_3 obj_13 obj_08)
   added: (pred_3 obj_13 obj_04)
   goals met: 0 of 3
4. (op_3 obj_12 obj_04 obj_02)
   deleted: (pred_3 obj_12 obj_04)
   added: (pred_3 obj_12 obj_02)
   goals met: 0 of 3
5. (op_2 obj_13 obj_07 obj_04 obj_01)
   deleted: (pred_2 obj_13 obj_07 obj_01)
   added: (pred_4 obj_07 obj_04) (pred_1 obj_13 obj_01)
   goals met: 1 of 3
6. (op_1 obj_12 obj_05 obj_02 obj_11)
   deleted: (pred_4 obj_05 obj_02) (pred_1 obj_12 obj_11)
   added: (pred_2 obj_12 obj_05 obj_11)
   goals met: 1 of 3
7. (op_1 obj_12 obj_06 obj_02 obj_09)
   deleted: (pred_4 obj_06 obj_02) (pred_1 obj_12 obj_09)
   added: (pred_2 obj_12 obj_06 obj_09)
   goals met: 1 of 3
8. (op_3 obj_12 obj_02 obj_08)
   deleted: (pred_3 obj_12 obj_02)
   added: (pred_3 obj_12 obj_08)
   goals met: 1 of 3
9. (op_2 obj_12 obj_06 obj_08 obj_09)
   deleted: (pred_2 obj_12 obj_06 obj_09)
   added: (pred_4 obj_06 obj_08) (pred_1 obj_12 obj_09)
   goals met: 2 of 3
10. (op_3 obj_12 obj_08 obj_04)
   deleted: (pred_3 obj_12 obj_08)
   added: (pred_3 obj_12 obj_04)
   goals met: 2 of 3
11. (op_2 obj_12 obj_05 obj_04 obj_11)
   deleted: (pred_2 obj_12 obj_05 obj_11)
   added: (pred_4 obj_05 obj_04) (pred_1 obj_12 obj_11)
   goals met: 3 of 3
